Cats_99/app/controllers/cats_controller.rb

INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @cat = Cat.new(params.require(:cat).permit(:name,:birth_date,:sex,:color,:description))

    if @cat.save

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["name", "the first cat"], ["description", "  The very first cat of our bd"], ["updated_at", "2019-01-30 00:58:49.122316"], ["id", 1]]
---
  def update
    @cat = Cat.find_by(id: params[:id])
    if @cat.update(params.require(:cat).permit(:name,:birth_date,:sex,:color,:description))